INSERT INTO author(first_name, last_name, middle_name)
VALUES ('Фиилип', 'Киндред', 'Дик'),
('Александр', 'Пушкин', 'Сергеевич'),
('Лев', 'Толстой', 'Николаевич'),
('Николай','Гоголь','Васильевич'),
('Уолтер','Айзексон',NULL);

INSERT INTO book(name, author_id)
VALUES ('Мечтают ли андроиды об электроовцах?', 1),
('Борис Годунов', 2),
('Евгений Онегин', 2),
('Война и мир', 3),
('Мёртвые души', 4),
('Стив Джобс', 5);

INSERT INTO genre(genre_name)
VALUES ('Научная фантастика'), 
('Трагедия'),
('Роман'), 
('Поэма'),
('Биография');

INSERT INTO book_genre(book_id, genre_id)
VALUES (1, 1), 
(2, 2), 
(3, 3), 
(4, 3), 
(5, 4), 
(6, 5);

INSERT INTO person(first_name, last_name, middle_name, birth_date)
VALUES ('Иван', 'Иванов', 'Иванович', '1970-01-01 06:00:00 +05:00'),
('Василий', 'Пупкин', 'Иванович', '1970-01-01 06:00:00 +05:00'),
('Николай', 'Петухов', 'Васильевич', '2001-03-17 02:11:59 +05:00'),
('Михаил', 'Кушинский', 'Евгеньевич', '1999-12-31 16:59:59 +05:00'),
('Дмитрий', 'Пожетнов', 'Александрович', '1989-07-15 07:00:00 +06:00');
	
INSERT INTO library_card(book_id, person_id)
VALUES (1, 2),
(4,2),
(6,5);
	
